# Mini Project 1

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("data.csv")
df

         Date       city  Temperature_c  Humidity_% Condition
0  01-01-2025  Hyderabad             28          60     Sunny
1  02-01-2025  Hyderabad             29          62    Cloudy
2  03-01-2025  Hyderabad             30          58     Rainy
3  04-01-2025   Banglore             31          55     Sunny
4  05-01-2025  Hyderabad             32          63    Cloudy
5  06-01-2025  Hyderabad             33          59     Rainy
6  07-01-2025   Banglore             34          54     Sunny

# Exploring Data

In [3]:
df.head()

         Date       city  Temperature_c  Humidity_% Condition
0  01-01-2025  Hyderabad             28          60     Sunny
1  02-01-2025  Hyderabad             29          62    Cloudy
2  03-01-2025  Hyderabad             30          58     Rainy
3  04-01-2025   Banglore             31          55     Sunny
4  05-01-2025  Hyderabad             32          63    Cloudy

In [4]:
df.tail()

         Date       city  Temperature_c  Humidity_% Condition
2  03-01-2025  Hyderabad             30          58     Rainy
3  04-01-2025   Banglore             31          55     Sunny
4  05-01-2025  Hyderabad             32          63    Cloudy
5  06-01-2025  Hyderabad             33          59     Rainy
6  07-01-2025   Banglore             34          54     Sunny

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Date           7 non-null      object
 1   city           7 non-null      object
 2   Temperature_c  7 non-null      int64
 3   Humidity_%     7 non-null      int64
 4   Condition      7 non-null      object
dtypes: int64(2), object(3)
memory usage: 412.0+ bytes

In [6]:
df.shape

(7, 5)

In [7]:
df[2:5]

         Date       city  Temperature_c  Humidity_% Condition
2  03-01-2025  Hyderabad             30          58     Rainy
3  04-01-2025   Banglore             31          55     Sunny
4  05-01-2025  Hyderabad             32          63    Cloudy

In [8]:
df.columns

Index(['Date', 'city', 'Temperature_c', 'Humidity_%', 'Condition'], dtype='object')

In [9]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [10]:
df.dtypes

Date             object
city             object
Temperature_c     int64
Humidity_%        int64
Condition        object
dtype: object

In [11]:
df.Date

0    01-01-2025
1    02-01-2025
2    03-01-2025
3    04-01-2025
4    05-01-2025
5    06-01-2025
6    07-01-2025
Name: Date, dtype: object

In [12]:
df['Date']

0    01-01-2025
1    02-01-2025
2    03-01-2025
3    04-01-2025
4    05-01-2025
5    06-01-2025
6    07-01-2025
Name: Date, dtype: object

In [13]:
df[['Date','Condition']]

         Date Condition
0  01-01-2025     Sunny
1  02-01-2025    Cloudy
2  03-01-2025     Rainy
3  04-01-2025     Sunny
4  05-01-2025    Cloudy
5  06-01-2025     Rainy
6  07-01-2025     Sunny

In [14]:
df['Date'][df['Condition']=='Sunny']

0    01-01-2025
3    04-01-2025
6    07-01-2025
Name: Date, dtype: object

# Reading Data

In [40]:
alpha_df=pd.DataFrame({
    "abc":["Apple","Ball","Cat","Dog","Egg"],
    "num":[17,7,30,47,49],
    "name":["Ajay","Satish","Deeven","Abhi","Tarun"]
})
alpha_df

     abc  num    name
0  Apple   17    Ajay
1   Ball    7  Satish
2    Cat   30  Deeven
3    Dog   47    Abhi
4    Egg   49   Tarun

In [41]:
alpha_df.head(2)

     abc  num    name
0  Apple   17    Ajay
1   Ball    7  Satish

In [42]:
alpha_df.tail(3)

   abc  num    name
2  Cat   30  Deeven
3  Dog   47    Abhi
4  Egg   49   Tarun

In [43]:
alpha_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   abc     5 non-null      object
 1   num     5 non-null      int64
 2   name    5 non-null      object
dtypes: int64(1), object(2)
memory usage: 252.0+ bytes

In [44]:
alpha_df.shape

(5, 3)

In [45]:
alpha_df[2:3]

   abc  num    name
2  Cat   30  Deeven

In [46]:
alpha_df.columns

Index(['abc', 'num', 'name'], dtype='object')

In [47]:
alpha_df.index

RangeIndex(start=0, stop=5, step=1)

In [48]:
alpha_df.dtypes

abc     object
num      int64
name    object
dtype: object

In [49]:
alpha_df.abc

0    Apple
1     Ball
2      Cat
3      Dog
4      Egg
Name: abc, dtype: object

In [50]:
alpha_df['num']

0    17
1     7
2    30
3    47
4    49
Name: num, dtype: int64